tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "vitorgalvao/tiny-scripts"
tap "workiva/workiva"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# General-purpose data compression with high compression ratio
brew "xz"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Java build tool
brew "ant"
# Google App Engine
brew "app-engine-python"
# Mozilla CA certificate store
brew "ca-certificates"
# Standard XML representation system for technical documents
brew "docbook"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# YAML Parser
brew "libyaml"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Distributed revision control system
brew "git"
# Polyglot tool version manager (asdf-compatible)
brew "mise"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Vector graphics library with cross-device output support
brew "cairomm"
# Vector graphics library with cross-device output support
brew "cairomm@1.14"
# Computational Geometry Algorithms Library
brew "cgal"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# File comparison utilities
brew "diffutils"
# Activates NFS on docker-machine
brew "docker-machine-nfs"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Cross language code generator for creating scalable microservices
brew "frugal"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Small git utilities
brew "git-extras"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# Gnumeric spreadsheet program
brew "goffice"
# GNOME Spreadsheet Application
brew "gnumeric"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.22"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Version Control Visualization Tool
brew "gource"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Development kit for the Java programming language
brew "openjdk@11"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle@6"
# Package for scientific computing with Python
brew "numpy"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Kubernetes package manager
brew "helm"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# C implementation of a Sass compiler
brew "libsass"
# Prompt theme engine for bash, zsh, fish, and more
brew "oh-my-posh"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Fast and user friendly build system
brew "meson"
# Parses Message Sequence Chart descriptions and produces images
brew "mscgen"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line interface for New Relic
brew "newrelic-cli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Post-processing for scanned/photocopied books
brew "unpaper"
# Generate sandwich OCR PDFs from scanned file
brew "pdfsandwich"
# Utility which converts PDF files into HTML and XML formats
brew "pdftohtml", link: false
# Display the PID number for a given process name
brew "pidof"
# Draw UML diagrams
brew "plantuml"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Unified tool to manage your Rancher server
brew "rancher-cli"
# File browser
brew "ranger"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Browser automation for testing purposes
brew "selenium-server"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Session manager for tmux (used by tmuxdev web layout)
brew "tmuxp"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Virtual meeting client
cask "adobe-connect"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Application launcher and productivity software
cask "alfred"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Client for the Google Drive storage service
cask "google-drive-file-stream"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Time optimising application
cask "rescuetime"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "arichika.previewseqdiag-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "dart-code.dart-code"
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jetbrains.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mscgenjs.vscode-mscgen"
vscode "ryanolsonx.zenburn"
