tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "vitorgalvao/tiny-scripts"
tap "workiva/workiva"
cask "adoptopenjdk"
# Search tool like grep, but optimized for programmers
brew "ack"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Vector graphics library with cross-device output support
brew "cairo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Java build tool
brew "ant"
# Google App Engine
brew "app-engine-python"
# Standard SGML representation system for technical documents
brew "docbook"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Activates NFS on docker-machine
brew "docker-machine-nfs"
# Image processing and image analysis library
brew "leptonica"
# Cross language code generator for creating scalable microservices
brew "frugal"
# GNU compiler collection
brew "gcc"
# Geometry Engine
brew "geos"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNOME Spreadsheet Application
brew "gnumeric"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Manage compile and link flags for libraries
brew "pkg-config"
# Version Control Visualization Tool
brew "gource"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Efficient network analysis for Python 3
brew "graph-tool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# The Kubernetes package manager
brew "helm"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Generic library support script
brew "libtool"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# Multi-format archive and compression library
brew "libarchive"
# C implementation of a Sass compiler
brew "libsass"
# YAML Parser
brew "libyaml"
# Adaptive prompt for bash and zsh shells
brew "liquidprompt"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Parses Message Sequence Chart descriptions and produces images
brew "mscgen"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generate sandwich OCR PDFs from scanned file
brew "pdfsandwich"
# PDF to HTML converter (based on xpdf)
brew "pdftohtml", link: false
# Display the PID number for a given process name
brew "pidof"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# The Rancher CLI is a unified tool to manage your Rancher server
brew "rancher-cli"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Browser automation for testing purposes
brew "selenium-server-standalone"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# Process YAML documents from the CLI
brew "yq"
# The Dart SDK
brew "dart-lang/dart/dart"
# The legacy Dart 1 SDK
brew "dart-lang/dart/dart@1", args: ["with-content-shell", "with-dartium"]
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "adobe-acrobat-reader"
cask "adobe-connect"
cask "anaconda"
cask "bettertouchtool"
cask "box-sync"
cask "brave-browser"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "geektool"
cask "gimp"
cask "google-drive-file-stream"
cask "intellij-idea"
cask "iterm2"
cask "kdiff3"
cask "libreoffice"
cask "macvim"
cask "minikube"
cask "p4v"
cask "slack"
cask "viscosity"
cask "wireshark"
