tap "dart-lang/dart"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/science"
tap "homebrew/versions"
tap "homebrew/x11"
tap "workiva/workiva"
brew "ack"
brew "cairo"
brew "icu4c"
brew "ant"
brew "docbook"
brew "asciidoc"
brew "asciidoctor"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "readline"
brew "bash"
brew "bash-completion"
brew "bison", link: true
brew "chromedriver"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "docker-machine-nfs"
brew "frugal"
brew "gcc"
brew "openssl"
brew "geos"
brew "ghostscript"
brew "git-extras"
brew "git-quick-stats"
brew "go"
brew "glide"
brew "gnumeric"
brew "gnupg", link: false
brew "lua"
brew "gnuplot"
brew "pkg-config"
brew "gource"
brew "gradle"
brew "graph-tool"
brew "libtool"
brew "graphviz"
brew "xz"
brew "python"
brew "grc"
brew "homeshick"
brew "kubernetes-helm"
brew "lcov"
brew "legit"
brew "leptonica"
brew "libarchive"
brew "libsass"
brew "libyaml"
brew "macvim", args: ["with-override-system-vim"]
brew "make", args: ["with-default-names"]
brew "maven"
brew "mercurial"
brew "mscgen"
brew "multitail"
brew "node"
brew "nvm"
brew "pandoc"
brew "parallel"
brew "poppler", link: false
brew "pdfsandwich"
brew "pdftohtml"
brew "pidof"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "rancher-cli"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace", args: ["with-wrap-pbcopy-and-pbpaste"]
brew "ruby"
brew "sassc"
brew "selenium-server-standalone"
brew "thrift", args: ["HEAD"]
brew "tig"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "wget"
brew "wxmac"
brew "yq"
brew "dart-lang/dart/dart", link: false
brew "dart-lang/dart/dart@1", args: ["with-content-shell", "with-dartium"], link: true
