adduser
apt
apt-transport-https
apt-utils
base-files
base-passwd
bash
binutils
bsdutils
build-essential
ca-certificates
checkinstall
console-setup
curl
dash
dbus-x11
debconf
debconf-i18n
diffutils
dirmngr
e2fsprogs
eject
erlang-crypto
erlang-dev
fd-find
findutils
fonts-ubuntu
gimp
git
gnupg
grep
gzip
highlight
hostname
htop
init
inotify-tools
iproute2
iputils-ping
isc-dhcp-client
jq
kbd
kmod
less
libdebconfclient0
libncurses-dev
libodbc2
libopengl-dev
libssl-dev
locales
liquidprompt
login
mawk
motd-news-config
mount
mise
ncurses-base
ncurses-bin
netbase
netcat-openbsd
nodejs
odbc-postgresql
passwd
patch
postgresql
postgresql-contrib
procps
python3
python3-pip
python3-venv
ranger
ripgrep
rsyslog
screen
sensible-utils
show-motd
snapd
socat
sudo
sysvinit-utils
tig
tmux
tzdata
ubuntu-keyring
ubuntu-standard
udev
unzip
usrmerge
vim
vim-tiny
whiptail
wsl-setup
x11-apps
zlib1g-dev
